surname_list = [  # список фамилий Санкт-Петербурга
    "Иванов",
    "Васильев",
    "Петров",
    "Смирнов",
    "Михайлов",
    "Фёдоров",
    "Соколов",
    "Яковлев",
    "Попов",
    "Андреев",
    "Алексеев",
    "Александров",
    "Лебедев",
    "Григорьев",
    "Степанов",
    "Семёнов",
    "Павлов",
    "Богданов",
    "Николаев",
    "Дмитриев",
    "Егоров",
    "Волков",
    "Кузнецов",
    "Никитин",
    "Соловьёв"
]

# распечатать фамилии и их номера
for pos, lname in enumerate(surname_list, start=1):
    print(pos, lname)